In [1]:
import mysql.connector
import pandas as pd

In [2]:
conn = mysql.connector.connect(
    host = "database-1.ckw5zu9hecdi.us-east-2.rds.amazonaws.com",
    port = 3306,
    user = "zero",
    password = "zerobase",
    database = "zerobase",
)

In [4]:
df= pd.read_csv("03. best_sandwiches_list_chicago2.csv", encoding='utf-8')
df.tail()

,Rank,Cafe,Menu,Price,Address
45,46,Chickpea,Kufta,$8.,2018 W. Chicago Ave
46,47,The Goddess and Grocer,Debbie’s Egg Salad,$6.50,25 E. Delaware Pl
47,48,Zenwich,Beef Curry,$7.50,416 N. York St
48,49,Toni Patisserie,Le Végétarien,$8.75,65 E. Washington St
49,50,Phoebe’s Bakery,The Gatsby,$6.85,3351 N. Broadwa

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     50 non-null     int64
 1   Cafe     50 non-null     object
 2   Menu     50 non-null     object
 3   Price    50 non-null     object
 4   Address  50 non-null     object
dtypes: int64(1), object(4)
memory usage: 2.1+ KB

In [14]:
sql = "create table sandwich (ranking int, cafe varchar(32), price float, address varchar(32))"
cursor = conn.cursor(buffered=True)
cursor.execute(sql)

In [16]:
cursor.execute("desc sandwich")
result = cursor.fetchall()

for row in result:
    print(row)

('ranking', b'int', 'YES', '', None, '')
('cafe', b'varchar(32)', 'YES', '', None, '')
('price', b'float', 'YES', '', None, '')
('address', b'varchar(32)', 'YES', '', None, '')

In [18]:
sql = "insert into sandwich values (%s, %s, %s, %s, %s)"

for i, row in df.iterrows():
    cursor.execute(sql, tuple(row))
    print(tuple(row))
    conn.commit()
conn.close()

DataError: 1136 (21S01): Column count doesn't match value count at row 1